//1.Як можна оголосити змінну у Javascript?
// Можна оголосити просто написав (x=1) за допомогою let , var , const
// 2.У чому різниця між функцією prompt та функцією confirm?
// prompt-Вона показує модальне вікно з текстовим повідомленням, полем, куди відвідувач може ввести текст, та кнопками ОК/Скасувати.
// confirm
// confirm показує модальне вікно з питанням  та двома кнопками: ОК та Скасувати.Результат: true, якщо натиснути кнопку OK, інакше — false.
// 3.Що таке неявне перетворення типів? Наведіть один приклад.
// Це коли при використанні різних операторів, самі оператори перетворюють операнти в типи. x = ("1"+2) - 2- було числом,а при додавані с стрічко стало стрічкою також.При порівняні ===. Всі операнти перетворюються в булевий тип

let admin;
let name = "Vladyslav";
admin = name;
console.log(admin);

let days = 4;
let time = days * 24 * 60 * 60;
console.log(time);

let age = prompt("Скільки тобі років?");
console.log(age);
