// 1.Описати своїми словами навіщо потрібні функції у програмуванні.
// Функції значно скорочують код та допомагають в кращому читанні його. Одну і ту саму функцію можна викликати безліч разів в різних частинах коду. За допомогою функції ми можемо передавати певні параметри та отримувати результат(дію) функції. Також функція може виконуватися і давати результат не міняючи код
// 2.Описати своїми словами, навіщо у функцію передавати аргумент.
// При передачі аргументів в функцію ми виконуємо функцію з цими аргументами. Функцію можно викликати різну кількість разів с різною кількістю аргументів при цьому кожен раз їх можна змінювати.З передаваю аргументів мі робимо код гнучким та зручним в зміні і використанні
// 3.Що таке оператор return та як він працює всередині функції?
// return повертає його значення в  функції не міняючи код ззовні. Після проголошення return в функції вона зупиняеться. Можно прописатии в любій частині коду.
let result;
function calcNumber(a, b, c) {
  switch (c) {
    case "+":
      return (result = a + b);

    case "-":
      return (result = a - b);
    case "*":
      return (result = a * b);

    case "/":
      return (result = a / b);

    default:
  }
}

calcNumber(
  +prompt("Write your first number"),
  +prompt("Write your second number"),
  prompt("Write operator + - * /")
);
console.log(result);
